git --version #Проверяет версию Гита
cd #Меняет директорию
ls #Список папок
clear # очищает историю запросов
git help - a #Список стандарт программм гита (ПРОБЕЛ ЧТОБЫ ПРОДОЛЖИТЬ СПИСОК )
                                              Q - выход
git command --help #Cправка по конкретной программе
git init #Инициализация гита (1 раз в начале проекта)
git commit #Создание слепка файла
hash #40 символов хранящих инфу про комит
git config --list --global/--local/--system #конфиг гита списком
git add #добавляет файл в гит
git status #Информация о файлах
git diff #Разница между файлами до совершения commit
git commit -am ""   #Создание commit